Revit 2027 API
HostObjectSubcomponentInfo.GetCurveLoop Method
 Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop GetCurveLoop()
Public Function GetCurveLoop As CurveLoop
public:
CurveLoop^ GetCurveLoop()
member GetCurveLoop : unit -> CurveLoop
Return Value
CurveLoop
 The CurveLoop.
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace